{
  "chapter_1": {
    "id": "chapter_1",
    "title": "PROTOCOL: THE DROP",
    "next_chapter": "chapter_2",
    "telemetry": {
      "loc": "Home Base // Current Timeline",
      "coords": "Unknown",
      "time": "Jan 20, 2026 // 02:00 AM",
      "weather": "Indoor // Controlled"
    },
    "scenes": [
      {
        "id": "intro_01",
        "text_blocks": [
          { "condition": "default", "text": "The air in the room tore open. It wasn't a portal; it was a glitch in reality. A silver sphere fell onto your desk with a heavy thud, cracking the surface." },
          { "condition": "mech_eng", "text": "The object hit your desk. It didn't bounce. High-density alloy. The seam lines were microscopic—machining tolerances that don't exist in 2026. It smelled like ozone and burnt clutch plates." },
          { "condition": "historian", "text": "The object fell like an omen from a Greek tragedy. It sat there, anachronistic and rude, interrupting your reading. It looked like something Da Vinci sketched but never had the titanium to build." }
        ]
      },
      {
        "id": "intro_03",
        "text_blocks": [
          { "condition": "default", "text": "The metal turned to liquid mercury the moment it touched your skin. It didn't clasp around your wrist; it sank IN." },
          { "condition": "high_tech", "text": "Nano-assemblers. Millions of them. You watched in horror as the silver liquid dissolved into your epidermis, weaving itself into your nervous system. No pain, just a terrifying sense of connection." },
          { "condition": "high_arts", "text": "It moved like living ink. The silver washed over your skin and disappeared beneath it, leaving a faint, glowing geometric tattoo that pulsed with your heartbeat." }
        ]
      },
      {
        "id": "intro_05",
        "text_blocks": [
          { "condition": "default", "text": "A notification flared in your vision. A single ping from halfway across the world. <br><br><strong>[SIGNAL DETECTED. PARTNER FOUND: {partner}]</strong>" }
        ]
      }
    ]
  },

  "chapter_2": {
    "id": "chapter_2",
    "title": "PROTOCOL: THE MIRROR",
    "next_chapter": "chapter_3", 
    "telemetry": {
      "loc": "Salar de Uyuni // Bolivia",
      "coords": "20.1338° S, 67.4891° W",
      "time": "Jan 20, 2026 // 17:30 PM",
      "weather": "Temp: 12°C // Precipitation: 80% // Surface: Water Mirror"
    },
    "scenes": [
      {
        "id": "ch2_01",
        "text_blocks": [
          { "condition": "default", "text": "You accepted the coordinate request. The world didn't fade to black; it folded. One moment you were in your room, the next, the air pressure dropped and the light blinded you." }
        ]
      },
      {
        "id": "ch2_02",
        "text_blocks": [
          { "condition": "default", "text": "You are standing on water, but you aren't sinking. The Salt Flats. It's the rainy season. The thin layer of water reflects the sky perfectly. There is no horizon. Just infinite blue above and below." }
        ]
      },
      {
        "id": "ch2_03",
        "text_blocks": [
          { "condition": "default", "text": "You see a figure standing fifty meters away. {partner} looks just as confused as you." },
          { "condition": "high_tech", "text": "Telemetry picks up a bio-signature ahead. {partner} is standing there. They aren't checking stats or looking at the tech; they are scanning the horizon, trying to process the logic of this place." },
          { "condition": "high_arts", "text": "A figure materializes ahead. {partner}. They look stressed, frantically tapping at the air, trying to debug the holographic interface that only they can see." }
        ]
      },
      {
        "id": "ch2_04",
        "text_blocks": [
          { "condition": "default", "text": "They walk towards you, their footsteps rippling the water-mirror. They hold up their left wrist. It glows with the same silver tattoo as yours." }
        ]
      }
    ]
  },

  "chapter_3": {
    "id": "chapter_3",
    "title": "PROTOCOL: THE ASSET TEST",
    "next_chapter": null,
    "telemetry": {
      "loc": "Salar de Uyuni // Bolivia",
      "coords": "20.1338° S, 67.4891° W",
      "time": "Jan 20, 2026 // 18:00 PM",
      "weather": "Condition: Sunset // Visibility: Perfect"
    },
    "scenes": [
      {
        "id": "ch3_01",
        "text_blocks": [
          { "condition": "default", "text": "The sun is setting. The temperature is dropping fast. You are stranded in the middle of the largest salt desert on Earth with no supplies." },
          { "condition": "high_guts", "text": "Survival analysis: You have no water, no thermal gear, and night is coming. Hypothermia risk is rising. You need shelter, or you need to move." }
        ]
      },
      {
        "id": "ch3_02",
        "text_blocks": [
          { "condition": "default", "text": "{partner} taps their wrist interface. 'The manual says we have an Asset Library. It says we can fabricate things.' They look at you. 'What do we need?'" }
        ]
      },
      {
        "id": "ch3_03",
        "text_blocks": [
          { "condition": "default", "text": "You open your menu. It's a mental catalog of every machine you understand. You visualize a vehicle. Something rugged. Something classic." },
          { "condition": "mech_eng", "text": "You close your eyes. You visualize a 1995 Land Rover Defender 90. Diesel engine. Snorkel intake. Diff locks. You don't just imagine it; you build it in your mind, bolt by bolt." },
          { "condition": "artist", "text": "You imagine a shape. Not just a car, but an aesthetic. A vintage jeep, battered but reliable, contrasting beautifully against the mirror-glass floor of the salt flat." }
        ]
      },
      {
        "id": "ch3_04",
        "text_blocks": [
          { "condition": "default", "text": "The air crackles with static. Digital dust swirls in front of you, coalescing into solid matter. A Land Rover slams onto the salt with a wet splash." },
          { "condition": "high_tech", "text": "Matter rearrangement complete. The vehicle is physically perfect. The engine is warm. It didn't just appear; the machine pulled it from a probability stream where it already existed." }
        ]
      },
      {
        "id": "ch3_05",
        "text_blocks": [
          { "condition": "default", "text": "{partner} laughs, a sound of pure disbelief. They open the driver's door. 'Shotgun,' they call out. 'Let's see if this thing actually runs.' You climb in. The adventure begins." }
        ]
      }
    ]
  }
}
