{
  "chapter_1": {
    "id": "chapter_1",
    "title": "PROTOCOL: THE DROP",
    "next_chapter": "chapter_2",
    "telemetry": {
      "loc": "Home Base // Current Timeline",
      "coords": "Unknown",
      "time": "Jan 20, 2026 // 02:00 AM",
      "weather": "Indoor // Controlled"
    },
    "scenes": [
      {
        "id": "intro_01",
        "text_blocks": [
          { "condition": "default", "text": "The air in the room tore open. It wasn't a portal; it was a glitch in reality. A silver sphere fell onto your desk with a heavy thud, cracking the surface." },
          { "condition": "mech_eng", "text": "The object hit your desk. It didn't bounce. High-density alloy. The seam lines were microscopic—machining tolerances that don't exist in 2026. It smelled like ozone and burnt clutch plates." },
          { "condition": "historian", "text": "The object fell like an omen from a Greek tragedy. It sat there, anachronistic and rude, interrupting your reading. It looked like something Da Vinci sketched but never had the titanium to build." }
        ]
      },
      {
        "id": "intro_03_transformation",
        "text_blocks": [
          { "condition": "default", "text": "The metal turned to liquid mercury the moment it touched your skin. It didn't clasp around your wrist; it sank IN." },
          { "condition": "high_tech", "text": "Nano-assemblers. Millions of them. You watched in horror as the silver liquid dissolved into your epidermis, weaving itself into your nervous system. No pain, just a terrifying sense of connection." },
          { "condition": "high_arts", "text": "It moved like living ink. The silver washed over your skin and disappeared beneath it, leaving a faint, glowing geometric tattoo that pulsed with your heartbeat." }
        ]
      },
      {
        "id": "intro_05_message",
        "text_blocks": [
          { "condition": "default", "text": "A notification flared in your vision. A single ping from halfway across the world. <br><br><strong>[SIGNAL DETECTED. PARTNER FOUND.]</strong>" }
        ]
      }
    ]
  },

  "chapter_2": {
    "id": "chapter_2",
    "title": "PROTOCOL: THE MIRROR",
    "next_chapter": null, 
    "telemetry": {
      "loc": "Salar de Uyuni // Bolivia",
      "coords": "20.1338° S, 67.4891° W",
      "time": "Jan 20, 2026 // 17:30 PM",
      "weather": "Temp: 12°C // Precipitation: 80% // Surface: Water Mirror"
    },
    "scenes": [
      {
        "id": "ch2_01_teleport",
        "text_blocks": [
          { "condition": "default", "text": "You accepted the coordinate request. The world didn't fade to black; it folded. One moment you were in your room, the next, the air pressure dropped and the light blinded you." },
          { "condition": "high_tech", "text": "You tapped [EXECUTE]. Your internal equilibrium shattered. It felt like being compressed into a .zip file and unzipped instantly on the other side of the planet." },
          { "condition": "high_lore", "text": "You stepped through the fold. It felt like walking through a heavy velvet curtain, only to step out onto the ceiling of the world." }
        ]
      },
      {
        "id": "ch2_02_setting",
        "text_blocks": [
          { "condition": "default", "text": "You are standing on water, but you aren't sinking. The Salt Flats. It's the rainy season. The thin layer of water reflects the sky perfectly. There is no horizon. Just infinite blue above and below." },
          { "condition": "architect", "text": "The Salar de Uyuni. The largest mirror on Earth. The structural integrity of the salt crust holds your weight, but the water creates a seamless visual loop. It is nature's most perfect minimalist design." }
        ]
      },
      {
        "id": "ch2_03_partner_intro",
        "text_blocks": [
          { "condition": "default", "text": "You see a figure standing fifty meters away. They look just as confused as you." },
          { "condition": "high_tech", "text": "Telemetry picks up a bio-signature ahead. A girl is standing there. She isn't checking stats or looking at the tech; she's sketching the horizon in a notebook. <strong>[CONTACT: THE ARCHITECT]</strong>" },
          { "condition": "high_arts", "text": "A figure materializes ahead. A tall guy. He looks stressed. He's frantically tapping at the air, trying to debug the holographic interface. <strong>[CONTACT: THE ENGINEER]</strong>" },
          { "condition": "high_guts", "text": "Someone else is here. They are scanning the perimeter, assessing threats. They look ready for a fight. <strong>[CONTACT: THE DRIFTER]</strong>" }
        ]
      },
      {
        "id": "ch2_04_meeting",
        "text_blocks": [
          { "condition": "default", "text": "They walk towards you, their footsteps rippling the water-mirror. They hold up their left wrist. It glows with the same silver tattoo as yours." },
          { "condition": "high_tech", "text": "'You're the signal?' she asks. Her accent is Brazilian. 'I was expecting something more... <i>Terminator</i>, less... college student.'" },
          { "condition": "high_arts", "text": "'You're the signal?' he asks. His accent is Indian. 'I assume you didn't press the button by accident? The probability of two users syncing is astronomical.'" }
        ]
      }
    ]
  }
}
