{
  "chapter_1_p1": {
    "id": "chapter_1_p1",
    "title": "PART 1: THE ANOMALY",
    "next_chapter": "chapter_1_p2",
    "telemetry": {
      "loc": "Home Base // Coordinates: Classified",
      "coords": "Unknown",
      "time": "Jan 20, 2026 // 14:00 PM",
      "weather": "Indoor // Mundane"
    },
    "scenes": [
      {
        "focus": "player",
        "text_blocks": [
          { "condition": "default", "text": "Let us speak of {player}. A perfectly functional human being who, much like the rest of us, was busy doing absolutely nothing of historical importance." },
          { "condition": "mech_eng", "text": "Let us speak of {player}. A creature of grease and logic. They sat in a room that smelled faintly of soldering iron, staring at a machine part with the intensity of a lover staring at a sunset." },
          { "condition": "popstar", "text": "Let us speak of {player}. The center of attention, even when alone. They were currently rehearsing a look of 'casual indifference' in the mirror, which ironically takes a lot of effort." }
        ]
      },
      {
        "focus": "player",
        "text_blocks": [
          { "condition": "default", "text": "Then, gravity decided to take a lunch break. A silver sphere fell onto the table. It didn't roll. It simply sat there, heavy with implication, like an unpaid bill." },
          { "condition": "high_tech", "text": "A silver sphere crashed the party. It hit the desk with a sound that wasn't metallic—it was dense, like a neutron star wrapped in chrome. {player}'s first instinct wasn't fear; it was to find calipers." }
        ]
      },
      {
        "focus": "player",
        "text_blocks": [
          { "condition": "default", "text": "Common sense dictates one should run from unidentified extraterrestrial objects. But curiosity is a terrible affliction. {player} touched it. And just like that, the metal dissolved into their skin, warm and inviting, like tea on a rainy afternoon." }
        ]
      }
    ]
  },

  "chapter_1_p2": {
    "id": "chapter_1_p2",
    "title": "PART 2: THE ECHO",
    "next_chapter": "chapter_2_sync",
    "telemetry": {
      "loc": "Secondary Location // Coordinates: Classified",
      "coords": "Unknown",
      "time": "Jan 20, 2026 // 05:30 AM",
      "weather": "Clear // Expectation of Chaos"
    },
    "scenes": [
      {
        "focus": "partner",
        "text_blocks": [
          { "condition": "default", "text": "Meanwhile, half a world away, {partner} was having a similarly confusing Tuesday. They were minding their own business, blissfully unaware that the universe was about to file a complaint." },
          { "condition": "architect", "text": "Meanwhile, {partner} was staring at a building. Not looking at it, but dissecting it. Judging the load-bearing walls. They were interrupted by a silver object crashing through their model." }
        ]
      },
      {
        "focus": "partner",
        "text_blocks": [
          { "condition": "default", "text": "The device found them too. It bonded with them. No pain, just a sudden realization that the world was suddenly much larger, and much more complicated." }
        ]
      }
    ]
  },

  "chapter_2_sync": {
    "id": "chapter_2_sync",
    "title": "PROTOCOL: GLOBAL HANDSHAKE",
    "next_chapter": "chapter_3_meeting",
    "telemetry": {
      "loc": "Planetary Orbit (Virtual)",
      "coords": "Global Coverage",
      "time": "T-Minus 0",
      "weather": "Data Storm"
    },
    "scenes": [
      {
        "focus": "player",
        "text_blocks": [
          { "condition": "default", "text": "The two devices woke up. They ignored the humans for a moment and spoke to each other. A pulse went out. Invisible to the eye, but felt by the soul." },
          { "condition": "high_tech", "text": "A handshake protocol initiated. The devices utilized the hosts' nervous systems as antennas. A wave of telemetry swept across the globe—scanning mountains, oceans, and encrypted servers in milliseconds." }
        ]
      },
      {
        "focus": "player",
        "text_blocks": [
          { "condition": "default", "text": "It mapped the planet. Every hidden bunker, every lost shipwreck, every coffee shop with decent Wi-Fi. And then, it pulled the two hosts together." }
        ]
      }
    ]
  },

  "chapter_3_meeting": {
    "id": "chapter_3_meeting",
    "title": "THE MIRROR",
    "next_chapter": "chapter_4_asset",
    "show_synergy": true,
    "telemetry": {
      "loc": "Salar de Uyuni // Bolivia",
      "coords": "20.1338° S, 67.4891° W",
      "time": "Jan 20, 2026 // 17:30 PM",
      "weather": "Precipitation: 80% // Surface: Mirror"
    },
    "scenes": [
      {
        "focus": "player",
        "text_blocks": [
          { "condition": "default", "text": "Teleportation is a rude way to travel. One moment you are home, the next you are standing on the sky. The Salar de Uyuni. The great mirror of Bolivia." }
        ]
      },
      {
        "focus": "partner",
        "text_blocks": [
          { "condition": "default", "text": "{player} spotted a figure in the distance. {partner}. They looked equally disheveled, scanning the horizon as if looking for a bus stop in the middle of an ocean." }
        ]
      },
      {
        "focus": "player",
        "text_blocks": [
          { "condition": "default", "text": "They approached each other. No grand speeches. Just the awkward nod of two people who realize they are stuck in the same lifeboat. The devices hummed, satisfied with the connection." }
        ]
      }
    ]
  },

  "chapter_4_asset": {
    "id": "chapter_4_asset",
    "title": "THE ASSET",
    "next_chapter": null,
    "telemetry": {
      "loc": "Salar de Uyuni // Bolivia",
      "coords": "20.1338° S, 67.4891° W",
      "time": "Jan 20, 2026 // 18:00 PM",
      "weather": "Temp dropping // Need Transport"
    },
    "scenes": [
      {
        "focus": "player",
        "text_blocks": [
          { "condition": "default", "text": "The sun began to dip. The beauty of the salt flats is treacherous; without shelter, the cold kills you with a smile. They needed a vehicle." }
        ]
      },
      {
        "focus": "player",
        "text_blocks": [
          { "condition": "default", "text": "They didn't summon a spaceship. They didn't ask for a tank. They asked for reliability. The air shimmered, and gravity bent to their will." }
        ]
      },
      {
        "focus": "player",
        "text_blocks": [
          { "condition": "default", "text": "It landed with a solid thud. A **Nissan X-Trail T31**. Not the new plastic ones. The boxy legend. Pearl White. Manual Transmission. 2.0L Diesel Turbo. The kind of car that says, 'I have a mortgage, but I can cross a river.'" },
          { "condition": "mech_eng", "text": "A **Nissan X-Trail T31** materialized. Pearl White. The M9R diesel engine ticked over with a rhythmic clatter—pure mechanical music. It was the top-spec model, complete with the hyper-roof rails with integrated high-beam lights." }
        ]
      },
      {
        "focus": "partner",
        "text_blocks": [
          { "condition": "default", "text": "{partner} opened the glovebox. There was a heavy, reassuring clunk. A small cache of ammunition. No guns visible—just the ammo. A polite suggestion from the universe that things might get dangerous later." }
        ]
      },
      {
        "focus": "player",
        "text_blocks": [
          { "condition": "default", "text": "{player} took the driver's seat. The gear stick felt cold and precise. They looked at {partner}. 'Shotgun?' The engine roared to life, echoing across the endless mirror." }
        ]
      }
    ]
  }
}
